/**
 * Export to JSON plugin for PHPMyAdmin
 * @version 0.1
 */
//
// Query:
//    SELECT image_name, four_letter_type, archetype, frontpage_blurb FROM `j16_groja_image` WHERE frontpage_blurb <> null
//

[{
    "image_name": "Special Agent Fox Mulder",
    "four_letter_type": "INFP",
    "archetype": "Fi",
    "frontpage_blurb": "I always suspected that Agent Mulder was an INFP - like me!"
}, {
    "image_name": "Agent Dana Scully - The X-Files - ESTJ?",
    "four_letter_type": "ESTJ",
    "archetype": "Te",
    "frontpage_blurb": "So Scully is the opposite of Mulder - who've guessed?"
}, {
    "image_name": "A Boss Who Didn't Like Me",
    "four_letter_type": "INFJ",
    "archetype": "Ni",
    "frontpage_blurb": "Once upon a time long long ago in a faraway place I was hired by Manager A. After about three months the department reorganized and I found myself working for Manager B. It turned out to be a challenging job, sometimes I felt I could not do anything right! Much later, I found out from Manager C that Manager A and Manager B argued a lot. Then I remembered that Manager A had hired me while Manager B was on vacation!!  The red in this image of Manager B makes it obvious to me that, Manager B had such strong feelings and after the reorg I never really had a chance."
}, {
    "image_name": "Tom 87",
    "four_letter_type": "INFP",
    "archetype": "Fi",
    "frontpage_blurb": "This image is based on a score from one of the first times I took the Keirsey Temperament Sorter.  Like many, at first I was surprised to learn I was an INFP!"
}, {
    "image_name": "mildred (my kitty cat) 1",
    "four_letter_type": "ISFP",
    "archetype": "Fi",
    "frontpage_blurb": "Just for fun I took the Groja Quiz, answering the questions as I imagine my cat (Mildred) might.  I thought her portrait would look a bit shy but \"warm\" nonetheless, and sure enough it does!"
}, {
    "image_name": "A Boss Who Liked Me",
    "four_letter_type": "ENFP",
    "archetype": "Ne",
    "frontpage_blurb": "Once upon a time long long ago in a faraway place I was hired by Manager A. After about three months the department reorganized and I found myself working for Manager B. It turned out to be a challenging job, sometimes I felt I could not do anything right! Much later, I found out from Manager C that Manager A and Manager B argued a lot. Then I remembered that Manager A had hired me while Manager B was on vacation!!  This is an image of Manager A, who was very friendly to me."
}, {
    "image_name": "George H. W. Bush",
    "four_letter_type": "ISTJ",
    "archetype": "Si",
    "frontpage_blurb": "When I wrote the original version of this program (for grad school in 1988) sometimes we would fill out the Keirsey Temperament Sorter guessing how famous people might answer the questions.  This is a portrait of George H. W. Bush, the 41st president (1989-1993) and father of George W. Bush, the 43rd president.  The Green shows that he is a very Logical person and the Yellow shows that he is very Pragmatic and down-to-earth."
}, {
    "image_name": "Roy B. Scherer",
    "four_letter_type": "ESTP",
    "archetype": "Se",
    "frontpage_blurb": "Back in college during the 1980s I was very interested in Libertarianism.  During that time I managed to get Roy B. Scherer to take the Keirsey Temperament Sorter.  A quick googling confirms that Roy is still a Libertarian who continues to lobby in Richmond Virginia for gun rights and the legalization of marijuana.  Here is an image of his personality."
}, {
    "image_name": "Dr. McCoy",
    "four_letter_type": "ESFP",
    "archetype": "Se",
    "frontpage_blurb": "Back in the day we enjoyed answering the Keirsey Temperament Sorter questions the way we thought certain Star Trek characters might answer them.  Here is an image of Dr. McCoy's warm, Emotional personality."
}, {
    "image_name": "Mr. Spock",
    "four_letter_type": "ISTJ",
    "archetype": "Si",
    "frontpage_blurb": "Back in the day we enjoyed answering the Keirsey Temperament Sorter questions the way we thought certain Star Trek characters might answer them.  Here is an image of Mr. Spock's score.  I always considered him more of a scientist - that is, more blue, preferring ideas to facts - and was surprised how much his image looks like George H. W. Bush's.  It's interesting to note that Mr. Spock has a bit more Feeling (Red) than GHW Bush...."
}, {
    "image_name": "Captain Kirk",
    "four_letter_type": "ESTJ",
    "archetype": "Te",
    "frontpage_blurb": "Back in the day we enjoyed answering the Keirsey Temperament Sorter questions the way we thought certain Star Trek characters might answer them.  Here is an image of Captain Kirk's score.  His personality is much like Mr. Spock's but more Extraverted (the largest line is vertical line) and more balanced (more colorful)."
}, {
    "image_name": "Jim Armstrong",
    "four_letter_type": "ESFJ",
    "archetype": "Fe",
    "frontpage_blurb": "When I lived in Richmond, Jim was one of my best friends. He was the center of a group of us and the only one I have seen to score 100% Extraverted on the Keirsey Temperament Sorter.  The portrait shows that Jim was a very warm, open person.  And I regret to note that I say \"was\" because Jim passed away April 5th, 2002.  I am certain that I am not alone in missing him very much!"
}, {
    "image_name": "Dr. Loren Carrier",
    "four_letter_type": "INTP",
    "archetype": "Ti",
    "frontpage_blurb": "When I started college, playing music was my favorite hobby.  For awhile I even made a few bucks playing bass in a bluegrass band!  When I started grad school I took some electronic music classes with Dr. Carrier.  As a former Assembly language programmer for NASA, he knew a great deal about the digital world, but valued his analog stereo equipment (yes I am talking not just vinyl but TUBES, people) a great deal.  I suppose one could call him \"eccentric,\" and the large amount of blue in his image attests to that."
}, {
    "image_name": "Walter Wright",
    "four_letter_type": "INTP",
    "archetype": "Ti",
    "frontpage_blurb": "During grad school, classes in Photography and Art History gradually caused me to lose interest in music and gain interest in the visual arts.  The conversion became complete probably about the time I read Point and Line to Plane by Wassily Kandinsky for a Computer Graphic Design class in VCU's Art Department.  The original version of this site (written in Lisp for an old 8088-based PC) wound up being the final project for a Masters of Interdisciplinary Studies degree.  Walter Wright was my academic advisor for this degree."
}, {
    "image_name": "Tom H - Latest Humanmetrics",
    "four_letter_type": "INFJ",
    "archetype": "Ni",
    "frontpage_blurb": "Having considered myself an INFP for many years, I've taken the quiz at humanmetrics.com  a few times recently, and keep coming out as an INFJ.  The two types are fairly similar, and my J\/P scores are fairly close.  Here is an image of my most recent results from that quiz."
}, {
    "image_name": "Bill Clinton, 'Verified'",
    "four_letter_type": "ENFP",
    "archetype": "Ne",
    "frontpage_blurb": "This article at personalitydesk.com claims that Bill Clinton is an ENFP: http:\/\/www.personalitydesk.com\/enfp-type-description.php .  The Blue represents his Idealistic view and the Red represents his Emotion.  These traits are evident in his enthusiasm, compassion, and love of freedom."
}, {
    "image_name": "Hillary Clinton",
    "four_letter_type": "ESTJ",
    "archetype": "Te",
    "frontpage_blurb": "This article at slate.com claims that Hillary is an ESTJ: http:\/\/www.slate.com\/id\/2184696\/ , and this seems reasonable and believable.  The Green represents her Logical decision-making and the Yellow represents her Pragmatic views.  These traits are evident in her reliability, devotion, attention to detail, and willingness to take charge."
}, {
    "image_name": "George W. Bush",
    "four_letter_type": "ESTP",
    "archetype": "Se",
    "frontpage_blurb": "This article claims that George W. Bush is an ESTP: http:\/\/www.slate.com\/id\/2184696\/ .  It also claims that 'They are a common presidential type: Both Roosevelts, JFK, and LBJ were ESTPs.'  The Yellow in the image represents their down-to-earth Pragmatism, and the Green represents their use of Logic when making decisions."
}, {
    "image_name": "John McCain",
    "four_letter_type": "ESTP",
    "archetype": "Se",
    "frontpage_blurb": "This article at Slate claims that John McCain is an ESTP: http:\/\/www.slate.com\/id\/2184696\/ , and that sounds reasonable and believable to us.  The Yellow represents his Pragmatic views and the Green represents his Logical decision making.  Both of these traits are evident in his practicality and willingness to take risks."
}, {
    "image_name": "Barack Obama",
    "four_letter_type": "ENFP",
    "archetype": "Ne",
    "frontpage_blurb": "This article claims Barack Obama is an ENFP: http:\/\/www.slate.com\/id\/2184696\/ , and we believe this is a reasonable and believable assessment.  The Blue in the image represents his Idealism and hope for the future, and the Red represents his Emotion.  Both of these qualities are evident in his support of legislation supporting making health care available to all people."
}, {
    "image_name": "Ralph Nader",
    "four_letter_type": "ENFJ",
    "archetype": "Fe",
    "frontpage_blurb": "According to keirsey.com, Ralph Nader is an ENFJ.  The Blue in the image represents his Idealism, and the Red represents his Emotional decision making.  These traits are evident in his political views, such as his hope for the future and concern for people."
}, {
    "image_name": "Abraham Lincoln - INTP",
    "four_letter_type": "INTP",
    "archetype": "Ti",
    "frontpage_blurb": "David Keirsey identifies Abraham Lincoln as an INTP. The Blue in the portrait represents his Idealism and the Green his Logical decision making.  His Idealism is evident in his speeches, such as the Gettysburg address and his Logic surely served him well during the time he spent as a lawyer."
}, {
    "image_name": "George Washington: ESTJ",
    "four_letter_type": "ESTJ",
    "archetype": "Te",
    "frontpage_blurb": "In his book <i>Please Understand Me II,<\/i> David Keirsey picks George Washington to represent the archetypal ESTJ.  The green vertical line in the portrait represents Washington's logical decision-making and the yellow represents his practical and down-to-earth views.  This decisiveness and awareness served him well during difficult times, such as those at Valley Forge."
}, {
    "image_name": "Thomas Jefferson - INTP",
    "four_letter_type": "INTP",
    "archetype": "Ti",
    "frontpage_blurb": "David Keirsey identifies Jefferson as an INTP.  The Blue in the portrait represents his Idealism and the Green his Logical decision making.  These characteristics are evident in his interests in topics such as philosophy, science and technology."
}, {
    "image_name": "enfj",
    "four_letter_type": "ENFJ",
    "archetype": "Fe",
    "frontpage_blurb": "Image of a Generic ENFJ, created for the Gallery. ROU?"
}, {
    "image_name": "enfp",
    "four_letter_type": "ENFP",
    "archetype": "Ne",
    "frontpage_blurb": "Image of a Generic ENFP for the Gallery."
}, {
    "image_name": "entj",
    "four_letter_type": "ENTJ",
    "archetype": "Te",
    "frontpage_blurb": "Image of a Generic ENTJ for the Gallery."
}, {
    "image_name": "entp",
    "four_letter_type": "ENTP",
    "archetype": "Ne",
    "frontpage_blurb": "Image of a Generic ENTP for the Gallery."
}, {
    "image_name": "esfj",
    "four_letter_type": "ESFJ",
    "archetype": "Fe",
    "frontpage_blurb": "Image of a Generic ESFJ, created for the Gallery."
}, {
    "image_name": "esfp",
    "four_letter_type": "ESFP",
    "archetype": "Se",
    "frontpage_blurb": "Image of a Generic ESFP, created for the Gallery."
}, {
    "image_name": "estj",
    "four_letter_type": "ESTJ",
    "archetype": "Te",
    "frontpage_blurb": "Image of a Generic ESTJ, created for the Gallery."
}, {
    "image_name": "estp",
    "four_letter_type": "ESTP",
    "archetype": "Se",
    "frontpage_blurb": "Image of a Generic ESTP, created for the Gallery."
}, {
    "image_name": "infj",
    "four_letter_type": "INFJ",
    "archetype": "Ni",
    "frontpage_blurb": "Image of a Generic INFJ, for the Gallery."
}, {
    "image_name": "infp",
    "four_letter_type": "INFP",
    "archetype": "Fi",
    "frontpage_blurb": "Image of a Generic INFP, for the Gallery."
}, {
    "image_name": "intj",
    "four_letter_type": "INTJ",
    "archetype": "Ni",
    "frontpage_blurb": "Image of a Generic INTJ, for the Gallery."
}, {
    "image_name": "intp",
    "four_letter_type": "INTP",
    "archetype": "Ti",
    "frontpage_blurb": "Image of a Generic INTP, for the Gallery."
}, {
    "image_name": "isfj",
    "four_letter_type": "ISFJ",
    "archetype": "Si",
    "frontpage_blurb": "Image of a Generic ISFJ, for the Gallery."
}, {
    "image_name": "isfp",
    "four_letter_type": "ISFP",
    "archetype": "Fi",
    "frontpage_blurb": "Image of a Generic ISFP, for the Gallery."
}, {
    "image_name": "istj",
    "four_letter_type": "ISTJ",
    "archetype": "Si",
    "frontpage_blurb": "Image of a Generic ISTJ, for the Gallery."
}, {
    "image_name": "istp",
    "four_letter_type": "ISTP",
    "archetype": "Ti",
    "frontpage_blurb": "Image of a Generic ISTP, for the Gallery."
}]
